{
    "user_info": {
        "Name": "user",
        "Phone": "9800000000",
        "Email": "user@gmail.com"
    },
    "asked_questions": [
        {
            "Question": "Goal Formulation Process",
            "Reply": "1. Assigning a group\n2. Environmental Scanning\n3. Determining and listing the potential goals\n4. Brainstorming on potential goals\n5. Reach the consequences\n6. Determine the major area of responsibility"
        },
        {
            "Question": "purpose of organixational goal",
            "Reply": "The main purposes of achieving goals are as follows: \n1. To provide guideline and direction: Goal is a desired destination that \norganization wants to reach. Thus, it provides the direction toward which the \norganizational activities should be focused. \n \n2. To develop a good planning: Planning is predetermining the activities for \nfuture. These activities can only be identified when organization know what it \nwants to achieve. So goals give idea about the expectation, the time frame, skills \nnecessary etc., which helps to make a effective plan. \n \n3. To motivate employee: Motivation is creating willingness in individual to give \nhigher effort toward work. This can only be possible when people think or accept \nthat, their need is fulfilled by their effort. Since goal is a outcome and provides an \nidea about what people can achieve in future .It motivates employees towards works. \n \n4. To utilize the resource optimally: Resource can be optimally utilized only when \nthere is precise definition and direction of work with motivated employees. Since \nthere all are for what the goal is meant for. Thus, goal helps in effective utilization \nof resources. \n \n5. To evaluate and control: Evaluation and control of organizational performance \nis essential to ensure that the organization ’s functions are working properly, and \npeople are within the tract (area, band) of budget limit and time schedule. This is \nonly possible, when there is goal."
        }
    ]
}